Revit 2027 API
StructuralSectionIWelded.TopFlangeThickness Property
 Top Flange Thickness.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopFlangeThickness { get; set; }
Public Property TopFlangeThickness As Double
	Get
	Set
public:
property double TopFlangeThickness {
	double get ();
	void set (double value);
}
member TopFlangeThickness : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace